Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxEvadc_bf.h
/** \brief Offset for Ifx_EVADC_ACCPROT1_Bits.APSS */
#define IFX_EVADC_ACCPROT1_APSS_OFF (8u)

/** \brief Length for Ifx_EVADC_ACCPROT1_Bits.APRP */
#define IFX_EVADC_ACCPROT1_APRP_LEN (8u)

/** \brief Mask for Ifx_EVADC_ACCPROT1_Bits.APRP */
#define IFX_EVADC_ACCPROT1_APRP_MSK (0xffu)

/** \brief Offset for Ifx_EVADC_ACCPROT1_Bits.APRP */
#define IFX_EVADC_ACCPROT1_APRP_OFF (16u)

/** \brief Length for Ifx_EVADC_ACCPROT1_Bits.APRS */
#define IFX_EVADC_ACCPROT1_APRS_LEN (4u)

/** \brief Mask for Ifx_EVADC_ACCPROT1_Bits.APRS */
#define IFX_EVADC_ACCPROT1_APRS_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_ACCPROT1_Bits.APRS */
#define IFX_EVADC_ACCPROT1_APRS_OFF (24u)

/** \brief Length for Ifx_EVADC_ACCPROT2_Bits.APF */
#define IFX_EVADC_ACCPROT2_APF_LEN (4u)

/** \brief Mask for Ifx_EVADC_ACCPROT2_Bits.APF */
#define IFX_EVADC_ACCPROT2_APF_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_ACCPROT2_Bits.APF */
#define IFX_EVADC_ACCPROT2_APF_OFF (0u)

/** \brief Length for Ifx_EVADC_ACCPROT2_Bits.APGC */
#define IFX_EVADC_ACCPROT2_APGC_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCPROT2_Bits.APGC */
#define IFX_EVADC_ACCPROT2_APGC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCPROT2_Bits.APGC */
#define IFX_EVADC_ACCPROT2_APGC_OFF (16u)

/** \brief Length for Ifx_EVADC_ACCPROT2_Bits.APEM */
#define IFX_EVADC_ACCPROT2_APEM_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCPROT2_Bits.APEM */
#define IFX_EVADC_ACCPROT2_APEM_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCPROT2_Bits.APEM */
#define IFX_EVADC_ACCPROT2_APEM_OFF (17u)

/** \brief Length for Ifx_EVADC_ACCPROT2_Bits.APTF */
#define IFX_EVADC_ACCPROT2_APTF_LEN (1u)

/** \brief Mask for Ifx_EVADC_ACCPROT2_Bits.APTF */
#define IFX_EVADC_ACCPROT2_APTF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_ACCPROT2_Bits.APTF */
#define IFX_EVADC_ACCPROT2_APTF_OFF (18u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.STCS */
#define IFX_EVADC_GLOB_ICLASS_STCS_LEN (5u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.STCS */
#define IFX_EVADC_GLOB_ICLASS_STCS_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.STCS */
#define IFX_EVADC_GLOB_ICLASS_STCS_OFF (0u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.AIPS */
#define IFX_EVADC_GLOB_ICLASS_AIPS_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.AIPS */
#define IFX_EVADC_GLOB_ICLASS_AIPS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.AIPS */
#define IFX_EVADC_GLOB_ICLASS_AIPS_OFF (6u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.CMS */
#define IFX_EVADC_GLOB_ICLASS_CMS_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.CMS */
#define IFX_EVADC_GLOB_ICLASS_CMS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.CMS */
#define IFX_EVADC_GLOB_ICLASS_CMS_OFF (8u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.SESPS */
#define IFX_EVADC_GLOB_ICLASS_SESPS_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.SESPS */
#define IFX_EVADC_GLOB_ICLASS_SESPS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.SESPS */
#define IFX_EVADC_GLOB_ICLASS_SESPS_OFF (10u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.STCE */
#define IFX_EVADC_GLOB_ICLASS_STCE_LEN (5u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.STCE */
#define IFX_EVADC_GLOB_ICLASS_STCE_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.STCE */
#define IFX_EVADC_GLOB_ICLASS_STCE_OFF (16u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.AIPE */
#define IFX_EVADC_GLOB_ICLASS_AIPE_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.AIPE */
#define IFX_EVADC_GLOB_ICLASS_AIPE_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.AIPE */
#define IFX_EVADC_GLOB_ICLASS_AIPE_OFF (22u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.CME */
#define IFX_EVADC_GLOB_ICLASS_CME_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.CME */
#define IFX_EVADC_GLOB_ICLASS_CME_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.CME */
#define IFX_EVADC_GLOB_ICLASS_CME_OFF (24u)

/** \brief Length for Ifx_EVADC_GLOB_ICLASS_Bits.SESPE */
#define IFX_EVADC_GLOB_ICLASS_SESPE_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_ICLASS_Bits.SESPE */
#define IFX_EVADC_GLOB_ICLASS_SESPE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_ICLASS_Bits.SESPE */
#define IFX_EVADC_GLOB_ICLASS_SESPE_OFF (26u)

/** \brief Length for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY0_LEN (12u)

/** \brief Mask for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY0_MSK (0xfffu)

/** \brief Offset for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY0_OFF (0u)

/** \brief Length for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY1_LEN (12u)

/** \brief Mask for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY1_MSK (0xfffu)

/** \brief Offset for Ifx_EVADC_GLOB_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_GLOB_BOUND_BOUNDARY1_OFF (16u)

/** \brief Length for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLB */
#define IFX_EVADC_GLOB_EFLAG_REVGLB_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLB */
#define IFX_EVADC_GLOB_EFLAG_REVGLB_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLB */
#define IFX_EVADC_GLOB_EFLAG_REVGLB_OFF (8u)

/** \brief Length for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLBCLR */
#define IFX_EVADC_GLOB_EFLAG_REVGLBCLR_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLBCLR */
#define IFX_EVADC_GLOB_EFLAG_REVGLBCLR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_EFLAG_Bits.REVGLBCLR */
#define IFX_EVADC_GLOB_EFLAG_REVGLBCLR_OFF (24u)

/** \brief Length for Ifx_EVADC_GLOB_EVNP_Bits.REV0NP */
#define IFX_EVADC_GLOB_EVNP_REV0NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_GLOB_EVNP_Bits.REV0NP */
#define IFX_EVADC_GLOB_EVNP_REV0NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_GLOB_EVNP_Bits.REV0NP */
#define IFX_EVADC_GLOB_EVNP_REV0NP_OFF (16u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.CDCH */
#define IFX_EVADC_GLOB_TF_CDCH_LEN (4u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.CDCH */
#define IFX_EVADC_GLOB_TF_CDCH_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.CDCH */
#define IFX_EVADC_GLOB_TF_CDCH_OFF (0u)

